var 标签1 = new 标签("标签1",null);
var 编辑框1 = new 编辑框("编辑框1",null,null,null,null,null);
var 标签2 = new 标签("标签2",null);
var 编辑框2 = new 编辑框("编辑框2",null,null,null,null,null);
var 单选框1 = new 单选框("单选框1",单选框1_被单击);
var 单选框2 = new 单选框("单选框2",单选框2_被单击);
var 按钮1 = new 按钮("按钮1",按钮1_被单击,null,null);
    window.onload=function(){ 
        远程发短信_创建完毕();
        
    }

	var 当前卡项=1;
	var 上级页面="";
function 远程发短信_创建完毕(){
	上级页面=窗口操作.取当前页面参数("ly");
	标签1.置外边距(10,0,0,0);
	单选框1.置选中状态(true);
	单选框2.置选中状态(false);
	编辑框1.置内容(窗口操作.取当前页面参数("sjr"));
	公用模块.发送网络请求(处理发送短信,"/config/query");
}
function 按钮1_被单击(){
	if(编辑框1.取内容()=="" || 编辑框2.取内容()=="" ){
		公用模块.信息框("提示","请输入完整信息");
		}else{
		公用模块.询问框("提示","是否向【"+编辑框1.取内容()+"】发送短信?","发送","取消",询问框被单击);
	}
}
function 处理发送短信(发送结果,返回信息){
	公用模块.关闭等待框();
	if(返回信息.code==200 ){
		if(返回信息.data.hasOwnProperty("extra_sim1") ){
			单选框1.置标题(公用模块.子文本替换(返回信息.data.extra_sim1,"\\+86",""));
			单选框2.置标题(公用模块.子文本替换(返回信息.data.extra_sim2,"\\+86",""));
			}else{
			公用模块.弹出提示("已发送");
		}
		}else{
		公用模块.弹出提示("发送失败");
	}
}
function 询问框被单击(按钮索引){
	var 接口={}

	if(按钮索引==0 ){
		接口={ "data": {"sim_slot": 当前卡项,"phone_numbers": 编辑框1.取内容(),"msg_content": 编辑框2.取内容()}}
	    公用模块.显示等待框("发送中...");
		公用模块.发送网络请求(处理发送短信,"/sms/send",接口);
	}
}
function 单选框1_被单击(){
	当前卡项=1;
}
function 单选框2_被单击(){
	当前卡项=2;
}
function 左侧图标被单击(){
	window.parent.跳转页面(上级页面);
}